In [14]:
import pandas as pd
#Empty DataFrame
df=pd.DataFrame()
print (df)

Empty DataFrame
Columns: []
Index: []

In [15]:
emp = pd.Series(['Parker','John','Smith','William'])
id=pd.Series([102, 107, 109, 114])
frame={'Emp':emp,'Id':id}
result=pd.DataFrame(frame)
print("\nSeries to DataFrame\n")
print(result)

Series to DataFrame

       Emp   Id
0   Parker  102
1     John  107
2    Smith  109
3  William  114

In [16]:
print("\nAdding new column:\n")
result['Age']=pd.Series([35,24,40,38])
print(result)

Adding new column:

       Emp   Id  Age
0   Parker  102   35
1     John  107   24
2    Smith  109   40
3  William  114   38

In [17]:
print("\nDeleting one column:\n")
del result['Age']
print(result)

Deleting one column:

       Emp   Id
0   Parker  102
1     John  107
2    Smith  109
3  William  114

In [20]:
print("Extracting the third row:\n")
print(result.loc[2])

Extracting the third row:

Emp    Smith
Id       109
Name: 2, dtype: object

In [21]:
print("\nSlice rows:\n",result[1:3])

Slice rows:
      Emp   Id
1   John  107
2  Smith  109

In [27]:
d2 = pd.DataFrame([['Dale', 123], ['Mark', 143]], columns=['Emp', 'Id'])
print("\nAdding new row values:\n", pd.concat([result, d2]))

Adding new row values:
        Emp   Id
0   Parker  102
1     John  107
2    Smith  109
3  William  114
0     Dale  123
1     Mark  143

In [31]:
print("\nDeleting particular row:\n",result.drop(1))

Deleting particular row:
        Emp   Id
0   Parker  102
2    Smith  109
3  William  114